{"title":"Infinite Scroll","link":"https://www.llun.me/posts/dev/2022-11-07-infinite-scroll","date":1667849188000,"content":"<p>แต่ก่อนเวลาทำ Infinite Scroll ท่าที่ทำกันส่วนใหญ่ในเว็บคือใข้ Scroll event แล้วดู scroll position ว่าถึงตำแหน่งที่ควรจะดึงข้อมูลหน้าถัดไปแล้วหรือยัง ซึ่งส่วนใหญ่จะเป็นเกือบๆ สุด list หรือที่ท้าย list ก็ได้แล้วแสดง UI ว่ากำลังโหลดข้อมูลช่วงต่อไป</p>\n\n  See the Pen <a href=\"https://codepen.io/llun/pen/RwJoRpm\">\n  Scroll event</a> by Maythee Anegboonlap (<a href=\"https://codepen.io/llun\">@llun</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.\n\n<p>ข้อเสียของวิธีนี้คือ scroll event ยิงออกมาบ่อยมาก ถ้า event handler เขียนไม่ดีหรือ throttle จำนวน event ที่รับมาจะมีผลกับ UI หน้าเว็บทันที ตั้งแต่เวลาเลื่อน list จะเห็นว่า list scroll แล้วกระตุก หรือไม่ก็ทำให้หน้าเว็บกิน battery มากขึ้น ทางแก้ที่ทำกันก็คือเอาส่วนที่ทำงานหนักเวลา scroll ไปใส่ใน throttle function ซะ ไม่ว่าจะเป็น <code>requestAnimationFrame</code> หรือ <code>_.throttle</code> ใน lodash</p>\n<p>แต่ปีนี้ 2022 แล้ว browser ทุกเจ้ามี API อีกตัวที่ออกมาเพื่อแก้ปัญหานี้โดยเฉพาะ นั่นคือ <a href=\"https://developer.mozilla.org/en-US/docs/Web/API/Intersection_Observer_API\" target=\"_blank\">Intersection Observer API</a> ที่ไม่ยิง event มาที่ฟังก์ชั่นตลอดหรือถี่อีกต่อไปแล้ว แต่ยิงมาเฉพาะตอนที่ DOM ที่เรา monitor ไว้โผล่มาเมื่อไหร่เท่านั้น จะให้โผล่มา 25% 50% หรือทั้งหมดแล้วเรียก function เพื่อโหลดข้อมูลหน้าถัดไปก็ได้</p>\n\n  See the Pen <a href=\"https://codepen.io/llun/pen/vYryXLL\">\n  Intersection Observer</a> by Maythee Anegboonlap (<a href=\"https://codepen.io/llun\">@llun</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.\n\n<p>ข้อดีของวิธีนี้คือไม่ต้อง Throttle, กำหนดเอาได้เลยว่าเลื่อนถึง element ไหนแล้วโหลด จะเลื่อนจนถึง element สุดท้าย หรือกลางๆ ก็ได้ ไม่ต้องคำนวนจากความสูงเหมือนแต่ก่อน และ browser ก็รองรับหมดแล้ว (คงไม่มีใครใช้ Internet Explorer แล้วมั้งปีนี้)</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"0ac203e5cd627a87b98e503547adac7ee3818dec57f10d0d27bb67c267ac0e48","category":"Me"}