{"title":"My wrong assumptions with ActivityPub","link":"https://www.llun.me/posts/dev/2023-01-07-my-wrong-assumptions-with-activity-pub","date":1673114484000,"content":"<p>While I'm building <a href=\"https://github.com/llun/activities.next\" target=\"_blank\">my ActivityPub server</a>, I went through a lot of wrong of Assumption that cause a few problems now, so this is a note about my mistakes while implementing it</p>\n<ol>\n<li>Actor id contains a username. Actor id is a URL or identifier of resource telling who doing it or own it. For Mastodon, it looks like this <code>https://server.tld/users/username</code>. So I assume that, it will alway have the user name in the last part which is totally wrong.<br />\n<br />\nRecently I tried to follow <a href=\"http://Misskey.io\" target=\"_blank\">Misskey.io</a> actor and found out <a href=\"http://Misskey.io\" target=\"_blank\">Misskey.io</a> <code>actorId</code> doesn't contain <code>username</code> but a random id in the end and to get the username, the request to actorId is required.</li>\n<li>To make mentions works, it has to put in tags too. The issue here is if the Note doesn't have Tag with mentions, although it can send to the recipient in Mastodon, but it won't shows as Mention on that side and won't have any notification telling the recipient that he got mentions too.</li>\n<li>Better to compact JSON input receives from other and also compact JSON output before sending out. At one point, I was moving all the ActivityStream context url to constant however, I also have a constant for public ActivityStream too which I use it wrong when I move the JSON output to it causing all my message cannot send out. It took me awhile to find out.</li>\n<li>Follower id is not alway in <code>https://server.tld/users/username/follower</code> format. This is the same issue as Actor id. I assume that follower id is alway <code>actorId</code> + <code>/follower</code> but it can be anything like <code>https://server.tld/follower/username</code> or something else. The URL is from the <code>actorId</code> result, follower property. I haven't fixed this issue yet, so my server will alway send the message out with wrong follower id for non-Mastodon server.</li>\n<li>User timeline contain only non-reply messages. This is another issue that I can't figure out yet how to display the main timeline. In the beginning, I just returns all the statuses that I receive because I thought it contains only statuses from whom I follow but in reality, it contains the statuses that those following got replies too which for some actor, it's a bit too much.<br />\n<br />\nSo, I reduce it to only status that original post by whom I'm following but this cause me missing some reply to myself. Now, I include the reply but it's also missing the status that reply to another reply but original status is my status which left me at this point.<br />\n<br />\nThe tricky part is, for Firebase, it's not just update the query to change the result but I have to construct the index to make the query work which can be expensive if this is growing.<br />\n<br />\nAnother issue is, if I unfollow the user, in Twitter, statuses from that user will disappear from the timeline which probably can do easily by joining the following users and status on SQL database but that's not true for Firebase. So, this is an another problem that I don't have a solution just yet. (Kind of have an idea e.g. update the local recipients when unfollow but that's still tricky and can be expensive)</li>\n</ol>\n<p>So, these are my major mistakes so far, my ActivityPub server is running quite fine now with few missing features but the main next two that I would like to add is boost and likes and I think that will cover a major functionality for ActivityPub.</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"5a0e55a0bb4f530c78d3f201e3b80f847a9cc727ae65329febb7bf05c1aa38dd","category":"Me"}