{"title":"Mastodon server with NextJS","link":"https://www.llun.me/posts/dev/2022-11-20-mastodon-server-with-nextjs","date":1668975796000,"content":"<p>In the last few weeks, I tried to get my Mastodon accounts for various servers, first with <a href=\"http://mas.to\" target=\"_blank\">mas.to</a> which is very unreliable lately, then glasgow.social which is also very unreliable in the first few days and the last few days end up in <a href=\"http://mastodon.in.th\" target=\"_blank\">mastodon.in.th</a>. Only issue with <a href=\"http://mastodon.in.th\" target=\"_blank\">mastodon.in.th</a> for me is, I live in the Netherlands, using the server in Thailand is a bit slower.</p>\n<p>Another issue with all these Mastodon servers is I don’t have control over my followers or any messages that I put in and with these unreliable issues I don’t feel my account on these small federate servers is safe also, moving account informations (followers, followings, messages etc) without needing to ask everyone is to control the domain and no federate server is supporting using your own domain now. (also no migration option if the server is going down, your mastodon account is gone)</p>\n<p>One option to solve this is setting up my Mastodon server, but with <a href=\"https://github.com/mastodon/mastodon#requirements\" target=\"_blank\">all these requirements</a> it’s not going to be easy, another option is <a href=\"https://docs-develop.pleroma.social/backend/installation/debian_based_en/\" target=\"_blank\">Pleroma</a> which is easier but still a lot of things to do.</p>\n<p>The good thing about Mastodon is, it’s using <a href=\"https://www.w3.org/TR/activitypub/\" target=\"_blank\">ActivityPub</a>, so I can just build something that is compatible with it and use something that is cheaper than those sql servers and that was what I did with this <a href=\"https://github.com/llun/activities.next\" target=\"_blank\">activities.next project</a>.</p>\n<p>The server is not really fully functional like Mastodon yet, it still lacks a lot of things e.g. reply, mention someone else, post an image and poll support etc. However, at this point, it can receive messages and send them to anyone who follows me already. It also supports follow and unfollow people. One thing I would like to add that Mastodon won’t support is supporting Actor domain name, so anyone that registers with this server can use any domain that points to it.</p>\n<h2>What is required to run this server <a href=\"#what-is-required-to-run-this-server\" target=\"_blank\">#</a></h2>\n<p>Two things currently,\nContainer?, AWS Lambda, Vercel or Cloud Function basically anything that can run Node.js as compute layer\nDatabase, currently it supports only Firebase and Sqlite3 (that I tested out but the query is built with Knex.js so technically, it should be able to be used with any SQL database with <a href=\"https://github.com/llun/activities.next/blob/main/migrations/20221110192701_init.ts\" target=\"_blank\">this schema</a>).</p>\n<h2>What next? <a href=\"#what-next%3F\" target=\"_blank\">#</a></h2>\n<p>My plan after this is\nMention and Reply\nOutbox timeline and pagination\nMain timeline query with proper to and cc\nMedia storage (via Apple Shared Album)\nMedia storage (via S3/GCS?)</p>\n<p>Currently, my main Mastodon account is <a href=\"https://llun.dev/@null\" target=\"_blank\">@null@llun.dev</a>, this can be followed from any Mastodon (or ActivityPub server) ping me there!</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"91b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"e09feeea12b58716dcad718a36cc05af02914d85b4c2da0da28d9f","category":"Me"}