{"title":"Container Query & overscroll-behavior","link":"https://www.llun.me/posts/dev/2022-11-04-container-query-and-overscroll-behaviour","date":1667589079000,"content":"<p>อาทิตย์นี้เจอ css property ที่น่าสนใจสองอย่าง <code>@container</code> กับ <code>overscroll-behavior</code> ทั้งสองอันรองรับใน iOS แล้วด้วย แต่อาจจะต้องรออีกหน่อยเพราะ iOS16 พึ่งออก ถ้าใช้ CSS สองอย่างนี้คนใช้ iOS ส่วนใหญ่อาจจะยังไม่เห็น แต่คนใช้ iPhone ส่วนใหญ่ก็อัพเกรดกันเร็วอยู่แล้ว</p>\n<h2>Container Query <a href=\"#container-query\" target=\"_blank\">#</a></h2>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Container_Queries\" target=\"_blank\">@container</a> ทำงานคล้ายกับ Media Query ที่ใช้กันมานาน แต่ต่างจาก Media Query คือแทนที่จะจะอิงกับขนาดของ Window และ Media type (screen, print). Container Query อิงกับขนาดของ parent container แทน.</p>\n<p>ที่สนใจเพราะ Container Query นี่ทำให้เอามาใช้กับ Web ที่แบ่งหน้าเป็นส่วนๆ เช่นด้านซ้ายเป็น Navigation แล้วด้านขวาเป็น Content ได้ง่ายกว่า Media Query มากไม่ต้องคอยคิดว่า หน้าจอขนาดนี้อะไรจะกระทบบ้างจากกฏไม่กี่อันอีกต่อไป แต่ไปขึ้นกับขนาดของ Parent Container แทน</p>\n\n  See the Pen <a href=\"https://codepen.io/llun/pen/RwJRNWZ\">\n  Container Query</a> by Maythee Anegboonlap (<a href=\"https://codepen.io/llun\">@llun</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.\n\n<p>จาก code ด้านบนถ้า resize หน้าจอลงเรื่อยๆ จน dom conversations ย่อลงจนถึงขนาดที่กำหนด แถบเวลาจะเลื่อนลงมา</p>\n<h2>overscroll-behavior <a href=\"#overscroll-behavior\" target=\"_blank\">#</a></h2>\n<p>อีก property ที่พึ่งรู้จักแต่อยู่ใน css มาได้ซักพักแล้ว <code>overscroll-behavior</code> ที่ไว้แก้ปัญหาเรื่อง overflow ที่เวลา scroll content ไปจนสุดแล้ว browser จะพยายามเลื่อนต่อถ้าหน้านั้นมี scroll ข้างนอกด้วย</p>\n\n  See the Pen <a href=\"https://codepen.io/llun/pen/VwdjEOR\">\n  Untitled</a> by Maythee Anegboonlap (<a href=\"https://codepen.io/llun\">@llun</a>)\n  on <a href=\"https://codepen.io\">CodePen</a>.\n\n<p>จาก code ด้านบนถ้าไม่ใส่ <code>overscroll-behavior</code> หลังจาก scroll menu ไปจนสุดแล้ว frame ด้านนอกจะ scroll ต่อ แต่พอใช้ <code>overscroll-behavior: contain</code> แล้ว scroll จะหยุดแค่ใน navigations</p>\n<p><code>overscroll-behavior</code> ตั้งได้สามอย่างคือ</p>\n<ol>\n<li><code>auto</code> ที่ให้ scroll ต่อถ้า frame ด้านนอก scroll ได้ด้วย</li>\n<li><code>contain</code> ให้ scroll แล้วหยุดใน dom นั้นไม่สนใจ scroll ด้านนอก แต่ถ้าเว็บ load ใน iframe แล้วหน้านอก iframe มีแถบให้เลื่อนก็จะ scroll ต่อนอก iframe</li>\n<li><code>none</code> ให้ scroll แล้วหยุดใน dom และไม่ส่งไปนอก iframe ด้วย</li>\n</ol>\n<h2>Browser supported <a href=\"#browser-supported\" target=\"_blank\">#</a></h2>\n<p>Container Query ยังค่อนข้างใหม่อยู่ Browser ที่รองรับหลักๆ มี Chrome กับ Safari ล่าสุด แต่ Firefox ยังไม่รองรับ ส่วน <code>overscroll-behavior</code> นี่รองรับหมดแล้ว</p>\n<p>หลังจากไม่ได้ตาม CSS มานานหลังจากเจอสองอย่างนี้ก็รู้สึกว่า CSS เดี๋ยวนี้ใช้ง่ายขึ้นมาก ยังไม่ต้องพูดถึง grid layout ที่ทำให้ทำตารางที่คุมความกว้างและความสูงง่ายขึ้นมาก จนรู้สึกกลับมาทำเว็บสนุกอีกครั้ง</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"ed161c4b80cc76fca3cc4d71a89228ecf32e6fcc1ee6cd26aa24004f8e3513eb","category":"Me"}