{"title":"Heated gloves","link":"https://www.llun.me/posts/ride/2024-02-04-heated-gloves","date":1707040722000,"content":"<p>หลังลองถุงมือสารพัดแบบที่ไม่ใช่ Heated gloves ไปปีที่แล้วพบว่าแทบไม่มีถุงมือไหนที่ใช้ปั่นจักรยานที่นี่ได้เลย แม้จะเป็น Goretex หรือ Primaloft แต่ปั่นจักรยานแบบทางไกล ยังไงก็เอาไม่อยู่โดยเฉพาะถ้าเจอฝนด้วยแล้ว เรียกว่าแทบไร้ประโยชน์ ปีที่แล้วมี<a href=\"https://www.bever.nl/p/extremities-furnace-pro-handschoen-GPBAD70033.html\" target=\"_blank\">ถุงมืออันเดียว</a> ที่สามารถทนใช้ได้มาจนถึงปัจจุบัน แต่ถ้าอุณหภูมิลงไปต่ำกว่า 5℃ หรือฝนตกหนัก ก็ไม่ค่อยรอดเหมือนกันถ้ามีลมแรง ปีนี้เลยหาถุงมือใหม่แต่เอาแบบที่เป็น Heated มีแบตเตอรี่แบบที่เพิ่มความร้อนอุ่นมือได้ ลองมาสามยี่ห้อ และเจอที่ถูกใจคิดว่าใช้ปั่นจักรยานแบบหนาว ลมแรง ฝนตกได้หละ</p>\n<h2>Ekoï heat concept bike <a href=\"#eko%C3%AF-heat-concept-bike\" target=\"_blank\">#</a></h2>\n<p><a href=\"https://www.ekoi.com/nl/winterhandschoenen/13453-winter-warmte-handschoenen-ekoi-warmte-concept-5-licht.html\" target=\"_blank\">ยี่ห้อแรกที่ลองเป็น Heated gloves สำหรับปั่นจักรยาน</a> ที่บางเฉียบแต่บังคับจักรยานไม่ต่างจากถุงมือทั่วไปเท่าไหร่ ถ้าอากาศไม่หนาวมาก ไม่ต่ำกว่า 5℃ เป็นถุงมือที่ใส่แล้วปั่นจักรยานดีมาก แต่ถ้าอุณหภูมิต่ำกว่า 5℃ หรือลมแรง หรือฝนตกเมื่อไหร่ แทบจะไร้ประโยชน์ทันที ถึงจะปรับให้อุ่นมือที่ระดับ max ก็ไม่ช่วยอะไร\nปัญหาอีกอย่างของถุงมือนี้คือ Battery ใช้ได้ไม่ค่อยนาน เพราะพอปรับให้อุ่นมือแบบ max แล้วมันอุ่นกว่าถุงมือเจ้าอื่น ใช้ไฟเยอะกว่าเจ้าอื่นลองเอาไปปั่นทางไกลดู 100km ต้องเปลี่ยน Battery ประมาณทุกชั่วโมง</p>\n<figure><img src=\"https://www.llun.me/posts/ride/2024-02-04-heated-gloves/ekoi.png\" alt=\"\" /><figcaption>Ekoï version แบบบางเฉียบ ใช้ได้ถึงประมาณพฤศจิกายน หลังจากนั้นหนาวเกินหละ</figcaption></figure>\n<h2>30Seven Heated gloves for cycling <a href=\"#30seven-heated-gloves-for-cycling\" target=\"_blank\">#</a></h2>\n<p><a href=\"https://www.30seven.com/collections/gloves/products/heated-gloves-grip-waterproof\" target=\"_blank\">ยี่ห้อที่สองเป็น Heated gloves สำหรับปั่นจักรยานเหมือนกัน</a> แต่หนากว่ายี่ห้อแรก แบบแรก (ยี่ห้อแรกมีแบบหนาเหมือนกัน แต่ไม่ได้ลอง) เป็นยี่ห้อที่เพื่อนแนะนำมา Battery compatible กับยี่ห้อแรก เป็นถุงมือที่อุ่นกว่านี่ห้อแรกแม้ไม่เปิดให้อุ่น Battery อยู่ได้พอๆ กับยี่ห้อแรก ปรับ Max แล้วอยู่ได้ประมาณชั่วโมงกว่า เป็นถุงมือที่ฝนตก ลมแรงแล้วเอาอยู่\nข้อเสียของ 30Seven คือ material ที่ใช้ในถุงมือมันกันทุกอย่างดีมาก พอมืออุ่นแล้วเหงื่อออกถุงมือไม่ดึงเอาเหงื่อออกไปด้วย ใช้ไปซักพักแล้วมือเปียกเพราะเหงื่อต้องดึงมืออกมาพัก แล้วเวลาอากาศหนาว ดึงมือออกมาเจออากาศเย็นมันไม่ค่อยอยากดึงเท่าไหร่ แต่ถ้าปั่นไม่ไกล แล้วไม่ได้ปั่นหนักมาก ก็เป็นถุงมือที่คิดว่าดีใช้ได้</p>\n<figure><img src=\"https://www.llun.me/posts/ride/2024-02-04-heated-gloves/30seven.png\" alt=\"\" /><figcaption>30Seven นี่หนากว่า Ekoï Bettery แบบเดียวกันสลับใช้กันได้ อุ่นกว่า Ekoï ที่ซื้อมา</figcaption></figure>\n<h2>Outdoor research Prevail Heated GORE-TEX gloves <a href=\"#outdoor-research-prevail-heated-gore-tex-gloves\" target=\"_blank\">#</a></h2>\n<p><a href=\"https://www.outdoorresearch.com/collections/gloves/products/prevail-heated-gore-tex-gloves-322224\" target=\"_blank\">ยี่ห้อสุดท้ายเป็น Heated gloves ที่ไม่ได้ออกแบบมาสำหรับปั่นจักรยาน</a> เป็นถุงมือที่หนามาก และอุ่นแต่ไม่อุ่นเท่า 30Seven สามารถกันน้ำ กันลมได้ดีพอๆ กับ 30Seven ถ้าลมแรงจะรู้สึกว่าปลายนิ้วจะเย็นนิดๆ แต่ถ้าเปิดให้อุ่นแบบ max แล้วก็รู้สึกว่าอุ่นถึงร้อนพอสมควร ข้อดีคือเป็นถุงมือที่ทำให้มือแห้งตลอด แม้เหงื่อออกก็ไม่รู้สึกว่ามือเปียกเลย สามารถใส่ได้ยาวจนจบ Trip ปั่นจักรยานแบบทางไกล​ (4 ชั่วโมง+) ข้อดีอีกอย่างที่รู้สึกว่าดีกว่า 30Seven/Ekoï คือ Battery อยู่ได้นานมาก ถ้าเปิดแบบ max คืออยู่ได้ 2 ชั่วโมงครึ่งพก Battery สำรองไปแค่ชุดเดียวเอาอยู่ (Ekoï กับ 30Seven นี่พกไป 3-4 ชุด) ข้อเสียคือ Battery ชาร์จนานมาก เรียกว่าชุดนึงชาร์จทีคืนนึง แต่ถ้ามีสำรองก็ไม่แย่เท่าไหร่ สลับใช้เอาได้ แต่ข้อเสียอีกอย่างคือ Battery ไม่ compatible กับ Heated gloves ยี่ห้ออื่น เพราะขั้วต่อเล็กกว่า Battery ของยี่ห้ออื่นเลยไร้ประโยชน์หมดตอนนี้</p>\n<h2>ทางเลือกอื่น <a href=\"#%E0%B8%97%E0%B8%B2%E0%B8%87%E0%B9%80%E0%B8%A5%E0%B8%B7%E0%B8%AD%E0%B8%81%E0%B8%AD%E0%B8%B7%E0%B9%88%E0%B8%99\" target=\"_blank\">#</a></h2>\n<p>จริงๆ มีอีกทางเลือกที่เพื่อนใช้อยู่คือใช้ <a href=\"https://radpowerbikes.eu/products/handlebar-mitts\" target=\"_blank\">Handlebar mitts</a> ที่เป็นถุงครอบกันลมอีกชั้น ก็คิดว่าน่าจะเอาอยู่เหมือนกัน แต่ส่วนตัวไม่ค่อยชอบความเทอะทะมันเท่าไหร่ อีกอย่าง นอกจากจะใช้ถุงมือพวกนี้ตอนปั่นจักรยานแล้ว ปกติใช้ตอนไม่ปั่นจักรยานด้วยตอนที่ ลมแรง ฝนตก หนาวมากๆ เพราะ Heated gloves นี่อุ่นกว่าถุงมือแบบไม่ heated แน่นอน</p>\n<p>ตอนนี้ก็ประมาณครึ่งทางของฤดูหนาวแล้ว อากาศที่ Netherlands ก็ไม่ค่อยจะหนาวมากแล้ว ส่วนใหญ่จะลมแรง และฝนตกมากกว่า เลยเริ่มกลับมาใส่แบบไม่ต้องใส่ถ่านแล้ว คงได้ใช้ถุงมือพวกนี้อีกทีก็หน้าหนาวหน้า</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"444e8155360b7c8b75fa575340633ca78ab2c383039fa9ebfb5bb09742fad162","category":"Category1"}