{"title":"Lasik","link":"https://www.llun.me/posts/2021-03-27-Lasik","date":1616803200000,"content":"<p>ช่วงต้นเดือนตัดสินใจทำเลสิกหลังจากเห็นคนรอบตัวทำกัน และช่วงหลังเริ่มมีปัญหาตาแห้งเพราะใส่ Contact lens ไปปั่นจักรยานบ่อยเลยคิดว่าถึงเวลาทำแล้วหละ ตอนค้นๆ ว่าทำที่ไหนดีก็ไปเจอ<a href=\"https://www.asiapacificeyecentre.com.sg/lasik/\" target=\"_blank\">เจ้านี้ที่ลดค่าตรวจจากปกติ ~S$200 เหลือ ~S$5</a> เลยกรอกฟอร์มแล้วก็นัดวันตรวจเลย</p>\n<p>กรอกฟอร์มเสร็จวันถัดมาก็โทรมานัดเลยว่าจะเข้าไปคลินิกได้เมื่อไหร่ แล้วก็ได้ตรวจวันจันทร์ถัดมา ตอนคุยคนที่โทรนัดก็บอกให้ลางานไว้ด้วยนะ เพราะยาที่หยอดตอนตรวจขยายม่านตาอาจทำให้ทำงานไม่ได้ เจอแสงสว่างจะรู้สึกจ้ากว่าปกติ วันนั้นหลังตรวจก็ประมาณนั้น แต่ก็ไม่ขนาดอ่านอะไรไม่ได้เลย</p>\n<p>ตรวจเสร็จหมอบอกตาซ้ายผลค่อนข้างหมิ่นเหม่ที่จะทำ Lasik อาจจะต้องทำ Lasek แทนซึ่งจะเจ็บกว่าและต้องพักนานขึ้น (Lasik ทำเสร็จวันถัดมาก็แทบจะเหมือนปกติแล้ว) ก็ได้<a href=\"https://www.webeyeclinic.com/pred-forte-eye-drops/pred-forte-eye-drops\" target=\"_blank\">ยาหยอดมาหนึ่งตัว</a> กับน้ำตาเทียมอีกกล่อง มีกำชับด้วยยาหยอด Steroid อย่าหยอดเกินอาทิตย์นะ</p>\n<p>วันทำ Lasik ตรวจตาเหมือนเดิมด้านซ้ายก็มีปัญหาเหมือนเดิมแต่สุดท้ายหมอให้ทำ Lasik ได้แล้วก็เตรียมเข้าห้องผ่าตัดเลย ก่อนทำหลายคนบอกว่าเร็ว แป๊บเดียวเสร็จ แต่มีเพื่อนขู่ก่อนมาด้วยว่าเจ็บอย่างน้อยสองวัน แต่เพื่อนทำ Lasek ส่วนหมอก็พูดปรอบใจบอกเจ็บแป๊บเดียว กับให้ยามากินให้มึนๆ จะได้ไม่ตื่นเต้นเกร็งตอนทำ</p>\n<p>ขั้นตอนทำที่เจ็บสุดคงเป็นตอนที่ใส่ suction เข้าตาโดยหมอจะเอาเทปมาติดขอบตาบนและล่างไว้ก่อนจากนั้นก็เอากรอบที่ lock ลูกตามาใส่แล้วเอาเครื่องมาดูดอากาศออกให้กรอบมาติดกับลูกตาไว้ ตอนดูดอากาศจะเหมือนตาโดนกดแล้วปวดรอบๆ ตลอดแต่พอเสร็จแล้วก็จะไม่ค่อยเจ็บแล้ว</p>\n<p>หลังจากอุปกรณ์ต่างๆ ถูกใส่รอบลูกตาเสร็จแล้วขั้นต่อไปไม่เจ็บ แต่แอบหวาดเสียวคือหมอจะเอามีดมาเปิดกระจกตาออก? ก่อนเปิดก็จะมียามาหยอดทำให้ไม่รู้สึกอะไร แต่ก็จะเห็นว่าเกิดอะไรขึ้นพอกระจกตาเปิดออกทุกอย่างก็จะเบลอกว่าเติมแม้หมอจะบอกว่าให้มองไปที่จุดสีแดงๆ แต่ก็จะมองยาก เพราะจุดมันย้ายเวลากระจกโดนพลิกออก หลังจากนั้นเลเซอร์จะยิงมาที่ตาแม้จะไม่รู้สึกอะไรแต่ก็จะได้กลิ่นใหม้เล็กน้อยจนกระทั่งกระจกตาโดนปิดกลับ แล้วเหมือนโดนเลเซอร์ยิงอีกที ทุกอย่างจะค่อยๆ ชัดขึ้นเหมือนใส่แว่น!</p>\n<p>ทำเสร็จสองข้างลุกออกมาจากเตียงปุ๊บ ทุกอย่างเบลอเล็กน้อย แต่เหมือนใส่ Contact lens และมีฟ้าขาว รอบๆ สิ่งที่มองตลอด ส่วนตาก็จะเหมือนมีอะไรอยู่ในลูกตาหลังจากนั้นหมอก็จะให้ไปนอนพักในห้องมืดซักสิบนาที แล้วก็ไปคุยเช็คทุกอย่างอีกที ทั้งหมดวันนั้นใช้เวลาประมาณสองชั่วโมง และทำเสร็จก็คือไม่ต้องใส่แว่น และไม่ปวดตา หรือมองอะไรไม่เห็น เดินกลับบ้านได้! (ตอนแรกก็คิดว่าจะกลับบ้านเอง แต่สุดท้ายวันนั้นก็โทรหาเพื่อนให้มาช่วยรับตอนเสร็จแล้ว ไม่อยากเสี่ยง)</p>\n<figure>\n  \n  <figcaption>ช่วงที่ทำก็ประมาณนี้ แนะนำอย่าดูตอนกินข้าว</figcaption>\n</figure>\n<p>หลังผ่าตัด ก็ได้ยาหยอดมาสองอัน Steriod ตัวเดิมแต่ให้หยอดถี่ขึ้น ยาหยอดตาฆ่าเชื้อ แล้วก็น้ำตาเทียม ตอนกลับบ้านก็ใส่แว่นกันแดด แต่ทุกอย่างมองเห็นชัด มีเคืองตาตลอด แต่หลังจากนั้นประมาณหกชั่วโมง อาการเคืองตาก็แทบไม่มีแล้ว แต่ปัญหานึงที่ชัดมากหลังทำเลสิกคือ Halo effect โดยเฉพาะเวลามองจอ monitor ที่พื้นหลังสีดำและมีตัวหนังสือสีขาว จะเห็นแสงขาวรอบๆ ตัวหนังสือ หรือไฟสัญญาณจราจรต่างๆ ด็จะมีแสงรอบๆ (แต่จอมือถือ iPhone ไม่มีปัญหาแฮะ)</p>\n<p>สิ่งมี่ต้องทำหลังผ่าตัดคือต้องคอยหยอดยาใส่ตาตลอดคืนแรกคือทุกชั่วโมง - สองชั่วโมงก่อนนอน และตอนนอนต้องแปะที่ครอบตาเพื่อเวลานอนเผื่อดิ้นแล้วจะได้ไม่ไปทับตาตัวเอง ทำแผลลอก แล้วก็อาบน้ำ ห้ามล้างหน้าหรือให้ตาโดนน้ำเด็ดขาด อย่างน้อยหนึ่งอาทิตย์ เพราะฉะนั้นงดออกกำลังกายทุกอย่างด้วยที่ทำให้เหงื่อออก แล้วอาจจะเข้าตา แล้ววันถัดมาก็มาตรวจตาอีกรอบด้วย</p>\n<p>วันนี้วันที่สองหลังทำ ทุกอย่างหายเกือบเป็นปกติหมดแล้ว ไม่มีอาการเคืองตาเท่าไหร่ แต่รอยแดงๆ ในลูกตาขาวยังเห็นอยู่ แต่น้อยกว่าหลังทำเสร็จ ตรวจตาเสร็จตอนเช้าทุกอย่างดูดี หยอดตาน้อยลงได้เหลือแค่ทุกสามชั่วโมงแทน ส่วนน้ำตาเทียม หยอดได้ตามต้องการ แล้วก็นัดเจออีกทีอาทิตย์หน้า</p>\n<p>เป็น Operation ที่น่ากลัวกว่าที่คิด ตอนนี้ก็บอกลาแว่นสายตาได้แล้ว! แม้หลายอย่าง(ตอนนี้ หมอบอกว่าตาขวาจะค่อยๆ ดีขึ้นหลังจากแผลรักษาตัวเสร็จ) จะยังไม่ชัดเท่าใส่แว่น แต่ไม่ต้องคอยดันแว่นขึ้นกับปวดหัวตอนฝ้าขึ้นแว่นเพราะหน้ากากกับอุณหภูมิเปลี่ยนก็ถือว่าเปลี่ยนชีวิตพอสมควร อีกอย่างต่อไปนี้ตอนไปปั่นจักรยานก็ไม่ต้องเผื่อเวลาใส่ Contact Lens แล้วได้เวลาตื่นนอนคืนมานิดนึง</p>\n<p>ค่าใช้จ่ายทั้งหมดสำหรับคลินิกนี้คือ S$3749.82 (ค่าตรวจตาวันแรก S$5 + ยาหยอดตา S$10.5 + น้ำตาเทียม S$22.0 + GST $2.63 + ค่าผ่าตัด S$3376 + ค่ายาหลังผ่าตัด S$91 + GST S$242.69) ราคาประมาณทำกับโรงพยาบาลเอกชนในไทย ตอนนี้ก็ประทับใจถือว่าคุ้มกับค่าใช้จ่ายหละ</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"5986dce64105103cec26d8da0cfe8c33ea5ece2298e355d6b0d3ec802a671fd5","category":"Me"}