{"title":"Feeds 2.5, bring back files database","link":"https://www.llun.me/posts/dev/2023-03-12-feeds-2-5","date":1678611412000,"content":"<p><a href=\"https://github.com/llun/feeds/releases/tag/2.0.0\" target=\"_blank\">Around beginning of last year</a> when I moved <a href=\"https://github.com/marketplace/actions/feedsfetcher\" target=\"_blank\">my feed action</a> from 11ty to NextJS. I also tried using sqlite database as feed content database. The idea is based on this <a href=\"https://phiresky.github.io/blog/2021/hosting-sqlite-databases-on-github-pages/\" target=\"_blank\">post</a> so I think, using database that can query in chunks for feeds might be a good idea especially if the feed list is getting long and content of feed item is big but it's never happen to <a href=\"https://feeds.llun.dev\" target=\"_blank\">my site</a>.</p>\n<p>The whole site is alway less than 10MB and the file that contains index and id link to the full content is less than 300KB which is a lot less than the <a href=\"https://github.com/llunbot/personal-feeds/blob/contents/sql-wasm.wasm\" target=\"_blank\">sqlite wasm</a> (the database <code>wasm</code> file alone is 1.24MB) making using the database is a lot slower compared to using json file that I used in 11ty.</p>\n<p>Other issue with the sqlite chunk is, if the database need to refresh (and for my feed site it refreshes every hour) the whole site will need to refresh compared to file with hash base on site url, the old index that already loads is still useful and I don't need to refresh a whole site when the content is refresh. This is the main reason I want to add the old file storage back.</p>\n<p>So, since the version <a href=\"https://github.com/llun/feeds/releases/tag/2.4\" target=\"_blank\">2.4</a>, I added the old json structure that I use in 11ty version back and make it default as in <a href=\"https://github.com/llun/feeds/releases/tag/2.5\" target=\"_blank\">2.5</a>. This should make the site that has small list of sites load faster and when continue reading while leave the page for sometime work without need to refresh again.</p>\n<p>I think the sqlite with chunk loading from the browser is still useful but only if the content in the database is large (more than 100MB maybe) then it will useful. Otherwise, small plain index file is better than using the sqlite in the browser or the structure of the database must be very complex e.g. need to create multiple different index files and need to join those information later then the sqlite will be more useful than the custom text structure that you need to design where should the file look like or where should it live.</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"7686c64ccc7233fd0fa9427fe9ec8c2a9fe6e1bb9fb3b0dc4777e3fba449299b","category":"Category1"}