{"title":"Moots 20,000km","link":"https://www.llun.me/posts/ride/2021-06-21-moots-20000km","date":1624752000000,"content":"<p><a href=\"/posts/ride/2020-02-01-moots-10000km/\">My first 10,000km</a> on this bike was done on 1 February 2020, at the time everything was very different from now and Singapore is still open to the world. I just did two Gran Fondo each in 2019 with the range 140km and 130km and came back from the US trip at the end of the year and cycling in the US with a Rapha rental bike.</p>\n<figure><img src=\"https://www.llun.me/posts/ride/2021-06-21-moots-20000km/hand.jpg\" /><figcaption>20,000km ☝️</figcaption></figure>\n<p>The next 10,000km is a very different story from the first one, now the border is closed, the pandemic is all over the world. I cannot bring a bicycle and travel around the world like I planned before. So here are some stats for this 10,000km</p>\n<ul>\n<li>1,325km are Virtual rides in Zwift. Mostly during the first Singapore lockdown (or circuit breaker) around May 2020 to July 2020.</li>\n<li>8,675km are riding around Singapore</li>\n<li>12 Round islands (112km version) from March 2020 to June 2021</li>\n<li><a href=\"/posts/ride/2021-01-01-festive-500/\">Complete Rapha 500km Festive in 2020!</a> With multiple 100km in one week! Probably not going to do it again 🤞</li>\n<li>1 Big round island (167km version) that feels a lot tougher than the Gran Fondo race I joined in 2019. No food station + Singapore heat during the day without cloud and rain (Tour de Bintan in 2019 has a heavy rain make the whole race quite chill, and Amy’s Gran Fondo is very chill for the great ocean road ride)</li>\n<li>Lamp Post 1 finally!</li>\n</ul>\n<figure><img src=\"https://www.llun.me/posts/ride/2021-06-21-moots-20000km/lamppost1.jpg\" /><figcaption>The cycling landmark, Lamp post 1</figcaption></figure>\n<p>Some bicycle parts also changed during this period</p>\n<ul>\n<li>My wheel hubs are now Chris King R45D. It feels heavier than the original but rolls further after stopping pedaling.</li>\n<li>Saddle upgrade to new Fizik Adaptive version, the 3d printing one does not feel much different at all except when it tilt down because the saddle rails is not oversize anymore pushing me a bit to the front and I feel more comfortable to sit on that angle (but won’t be able to do it in the race?)</li>\n</ul>\n<figure><img src=\"https://www.llun.me/posts/ride/2021-06-21-moots-20000km/saddle.jpg\" /><figcaption>New shiny saddle that does not feel much different from the old one</figcaption></figure>\n<p>So, for this 10,000km is not really bad, however, the next one will be tougher. Now I start to go to the gym and do weight training. The leg day made it very hard to ride out early in the morning and almost impossible to do the hill climbing after squats with 70kg in the back for a few sets. Hopefully the number is still the same and the next 10,000km for this bike will be in the next 2 years or 2023!</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"8f6e3336d2b026f93fcc12073ffb93d854b0d5515954ecf3e525a306e783004d","category":"Me"}