{"title":"หนึ่งปีที่ผ่านมาใน Netherlands","link":"https://www.llun.me/posts/2023-03-25-a-year-in-the-netherlands","date":1679779242000,"content":"<p>เขียน<a href=\"https://llun.dev/@null/f9af4a64-3e1c-4b87-bb1e-c0ccb3f51cba\" target=\"_blank\">สั้นๆ</a> ไปแล้วรอบแล้วคิดว่ามาเขียนเพิ่มแบบยาวหน่อยว่าปีที่ผ่านมาทำอะไรมาบ้างหลังจากย้ายมาอยู่ Netherlands มีหลายอย่างที่ชอบ และไม่ชอบ และก็หลายอย่างต่างจากที่คิดพอสมควร</p>\n<h2>สภาพอากาศ <a href=\"#%E0%B8%AA%E0%B8%A0%E0%B8%B2%E0%B8%9E%E0%B8%AD%E0%B8%B2%E0%B8%81%E0%B8%B2%E0%B8%A8\" target=\"_blank\">#</a></h2>\n<p>ก่อนมาก็คิดว่าที่นี่จะหนาว แต่ไม่คิดว่าหน้าดอกไม้ผลิจะยังหนาวอยู่ และหนาวกว่าที่คิดเพราะช่วงต้นเมษายนที่เป็นหน้าร้อนของไทยแล้ว ที่นี่ยังมีหิมะตกอยู่ (อย่างน้อยก็วันนึงหลังจากที่พึ่งมาเดือนแรก) และเคยคิดว่าหิมะตกมันก็คงไม่ลำบากอะไร แต่ที่นี่มันตกไม่เยอะแต่ทางเดินเท้าเหมือนมีน้ำแข็งบางๆ แปะไว้แล้วเดินลำบากมาก เหมือนจะลื่นตลอดเวลา</p>\n<p>แต่พอถึงหน้าร้อนจริงๆ ประมาณเดือนมิถุนายน ก็ไม่ร้อนมากเหมือนที่ไทยหรือสิงคโปร์ อุณหภูมิประมาณ 20℃ ปลายๆ ซะส่วนใหญ่มีวันสองวันที่เจอ heatwave แล้วอากาศร้อนไปถึง 35℃ แต่ถ้ามีร่มไม้ก็ไม่ร้อนมาก อยู่ได้แบบไม่ต้องเปิดแอร์</p>\n<p>ช่วงที่คิดว่าแย่จริงๆ คือต้นเดือนธันวาคมถึงมีนาคมที่เป็นหน้าหนาวของที่นี่แล้วบางวันอากาศลงมาแตะประมาณ 0℃ ซึ่งถ้าเป็นเมืองที่ไม่มีลมแรงเหมือนอย่าง Netherlands ก็คงไม่แย่เท่าไหร่แต่ที่นี่ลมแรงมาก 0℃ + ลม + ฝน นี่คือแย่สุดแทบไม่อยากออกไปข้างนอก (แต่คนที่นี่ก็ยังปั่นจักรยานกันเป็นปกติ!)</p>\n<p>รวมๆ แล้วหน้าร้อนเป็นอะไรที่อากาศดีมาก ส่วนหน้าหนาวก็โหด แต่ก็ไม่มากขนาดทนอยู่ไม่ได้ แต่ก็คิดอยู่ว่าชอบอากาศประมาณสิงคโปร์มากกว่าที่นี่หน่อยนึง</p>\n<h2>จักรยาน <a href=\"#%E0%B8%88%E0%B8%B1%E0%B8%81%E0%B8%A3%E0%B8%A2%E0%B8%B2%E0%B8%99\" target=\"_blank\">#</a></h2>\n<p>ตอนวางแผนย้ายออกจากสิงคโปร์ อย่างนึงที่อยู่ในแผนคือเมืองที่จะย้ายมาต้องปั่นจักรยานง่าย และ Netherlands ก็ไม่ทำให้ผิดหวัง ปั่นง่ายจริงโดยเฉพาะนอกเมือง มีทางจักรยานโดยเฉพาะเกือบทั้งประเทศ ช่วงหน้าร้อนคือได้ปั่นแทบทุกวัน เพราะมืดช้า แต่ว่างปีที่ผ่านมาเกิดล้มช่วงหน้าร้อนเสียก่อน เลยปั่นได้น้อยกว่าที่คิด ไม่เช่นนั้นน่าจะปั่นได้เยอะกว่านี้</p>\n<p>อย่างเดียวที่ไม่คิดว่าจะทำให้การปั่นจักรยานที่นี่ยากคือ ลม เพราะตอนปั่นอยู่สิงคโปร์ก็คิดว่าลมแรงบางช่วง แต่ก็ปั่นไม่ยากเท่าไหร่ แต่ที่นี่ลมโหดกว่าสิงคโปร์หลายเท่านั้น บางวันคือพัดแรง 40kph และมีลมกระโชกบางช่วงที่บางทีแรงถึง 70kph แล้วปัดจักรยานได้ ปั่นมาปีนึงเจอลมแรงแบบนี้ก็ยังไม่มั่นใจ ต้องหยุดหรือปั่นช้าลงทุกที โดยเฉพาะปั่นในเมือง ที่ไม่ค่อยอยากล้มลงกลางถนนเท่าไหร่</p>\n<p>นอกจากลมอย่างอื่นถือว่าปั่นจักรยานที่นี่สนุกมาก (ยกเว้นหน้าหนาวที่บา\nช่วงทางเป็นน้ำแข็ง ปั่นไปโดนเหมือนปั่นไปเจอกำแพง ต้องคอยหลบหรือไม่ก็ลงไปเข็นง่ายกว่า) ตอนแรกคิดว่าจะไม่ได้ปั่น 100km ครบทุกเดือนแล้ว แต่ก็ยังปั่นได้ครบทุกเดือนอยู่ เดือนที่ยากที่สุดคงเป็นเดือนธันวาคม ที่ปั่นลุยอากาศต่ำกว่า 0℃ + ลม ปั่นเสร็จก็ป่วยต่ออีกสองอาทิตย์เลย ปีนี้ก็คิดว่าจะพยายามปั่นให้ครบอยู่ แต่มีประสบการ์ปั่นหน้าหนาว + อุปกรณ์ครบแล้ว หลังจากธันวาคมเจออากาศต่ำกว่า 0℃ อีกแต่ก็ไม่แย่เท่าครั้งแรกหละ</p>\n<h2>ปีใหม่ <a href=\"#%E0%B8%9B%E0%B8%B5%E0%B9%83%E0%B8%AB%E0%B8%A1%E0%B9%88\" target=\"_blank\">#</a></h2>\n<p>ปีใหม่ที่ผ่านมาเป็นอะไรที่ไม่คิดว่าจะเขียนถึงเพราะปกติแต่ละประเทศก็จะมี event เป็นเอกลักษณ์ของตัวเอง + จุดพลุใหญ่ครั้งเดียวจบ แต่อัมสเตอร์ดัม​ (หรือทั้ง Netherlands) ช่วงปีใหม่เป็นอะไรที่บ้ามาก เพราะที่นี่ไม่จุดพลุให้ดูสวยงาม ครั้งเดียว แต่จุดทั้งเมือง ทุกเมือง ทั้งประเทศเล่นแบบยาวมากตั้งแต่ช่วงเย็นจนถึงเช้าวันถัดมา ติดกัน เรียกว่าแทบไม่ได้นอนเลยทั้งคืน ปีนี้คิดว่าคงหนีไม่อยู่ช่วงนั้นแล้ว</p>\n<h2>พิพิธภัณฑ์ <a href=\"#%E0%B8%9E%E0%B8%B4%E0%B8%9E%E0%B8%B4%E0%B8%98%E0%B8%A0%E0%B8%B1%E0%B8%93%E0%B8%91%E0%B9%8C\" target=\"_blank\">#</a></h2>\n<p>อย่างนึงที่ชอบ Netherlands คือที่นี่มีพิพิธภัณฑ์เยอะมากและมีแทบทุกเมืองและหลายแบบ พิพิธภัณฑ์เทคโนโลยีคิดว่ายังไม่มีดีไม่เท่าที่ Berlin แต่หลายอย่างก็ทำให้รู้สึกอยากมาอีกหลายรอบอยู่ ที่ที่ชอบและคิดว่าน่าไปซ้ำก็มี</p>\n<ul>\n<li><a href=\"https://www.marinemuseum.nl/en/\" target=\"_blank\">Navy Museum</a> ที่ Den Helder มีเรือดำน้ำยกขึ้นมาบนบกให้เข้าไปดูได้ และมีเรือรบสมัยก่อนอื่นๆ ด้วยที่ให้เดินเข้าไปดู แต่เรือดำน้ำที่เจ๋งสุดหละ ในพิพิธภัณฑ์ก็มีเล่าถึงกองทัพเรือของ Dutch ในสมัยก่อนด้วยว่ามีอะไรบ้าง ถ้าชอบ model เรือที่นี่มีให้ดู อธิบายจนอิ่ม</li>\n<li><a href=\"https://maritiemmuseum.nl/en\" target=\"_blank\">Maritiem Museum</a> ที่ Rotterdam ให้ดูเกี่ยวกับเรือสินค้าทั้งหลาย และระบบท่าเรือที่นี่ พร้อมแผนที่ความใหญ่ของท่าเรือ + โรงงานจำลองให้ดูวิธีทำชิ้นส่วนเรือต่างๆ</li>\n<li><a href=\"https://www.annefrank.org/en/\" target=\"_blank\">Anna Frank house</a> บ้าน Anna Frank พร้อมประวัติและรายละเอียดว่าช่วงที่ Anna Frank อยู่ที่บ้านนี้เกิดอะไรขึ้นบ้าง</li>\n<li><a href=\"https://www.rembrandthuis.nl/nl/\" target=\"_blank\">Rembrandt house</a> บ้านที่ Rembrandt เคยอาศัยอยู่ เป็นพิพิธภัณฑ์ที่อยู่ใกล้บ้านมาก และไม่เคยรู้มาก่อนว่าจะเป็นศิลปินที่นี่ที่ดังมาก แต่ก่อนรู้จักแต่ Van Gogh แต่เหมือนคนที่นี่จะพูดถึง Rembrandt มากกว่า</li>\n<li><a href=\"https://www.aviodrome.nl/?\" target=\"_blank\">Luchtvaart Museum Aviodrome</a> พิพิธภัณฑ์การบินที่เอาเครื่องบินจริงๆ มาผ่าให้ดู และอยู่ข้างสนามบิน!</li>\n</ul>\n<p>ที่ไปมีเยอะมาก แต่ชอบสุดก็คิดว่า 5 พิพิธภัณฑ์นี้ Navy กับ Luchtvaart นี่คิดว่าอยู่ อันดับ 1 กับ 2 ที่ชอบเลย (อาจจะเท่ากันด้วย) แต่ปีนึงแล้วก็ยังมีหลายที่ที่ยังไม่ได้ไป (หรือไม่ก็ยังไม่รู้จัก) ปีนี้คงเก็บต่อให้ครบทั้งประเทศ</p>\n<h2>ฤดูดอกไม้ผลิ <a href=\"#%E0%B8%A4%E0%B8%94%E0%B8%B9%E0%B8%94%E0%B8%AD%E0%B8%81%E0%B9%84%E0%B8%A1%E0%B9%89%E0%B8%9C%E0%B8%A5%E0%B8%B4\" target=\"_blank\">#</a></h2>\n<p>ช่วงเดือนมีนาคม - เมษายนปีที่แล้วเป็นการแนะนำให้รู้จักฤดูใบไม้ผลิที่ดีมาก เพราะอยู่สิงคโปร์/ไทยแล้วรู้สึกว่าไม่มีฤดูนี้ และไม่เข้าใจว่า ฤดูใบไม้ผลิน่าตื่นเต้นยังไง แต่พอได้ไปดูสวน <a href=\"https://keukenhof.nl/en/\" target=\"_blank\">Keukenhof</a> สองรอบตอนที่เริ่มผลิช่วงปลายมีนาคม กับตอนที่ผลิเต็มที่ช่วงกลางเดือนเมษายน แล้วก็รู้สึกว่าสวนดอกไม้ที่นี่โหดมาก และสวยมากรู้สึกที่ไทยไม่เยอะและโหดเท่านี้</p>\n<p>แต่ Netherlands มีมากกว่า Keukenhof โดยเฉพาะเมืองที่ Keukenhof อยู่ Leiden แค่ปั่นไปรอบๆ ก็จะเจอแปลงดอกไม้ที่ปลูกขายหลายแปลงมาก แค่แต่ละที่ต้องปั่นไกลเสียหน่อย แต่ก็คุ้มถ้าชอบดอกไม้</p>\n<h2>เลือกตั้งสภาจัดการน้ำ <a href=\"#%E0%B9%80%E0%B8%A5%E0%B8%B7%E0%B8%AD%E0%B8%81%E0%B8%95%E0%B8%B1%E0%B9%89%E0%B8%87%E0%B8%AA%E0%B8%A0%E0%B8%B2%E0%B8%88%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B8%99%E0%B9%89%E0%B8%B3\" target=\"_blank\">#</a></h2>\n<p>อย่างนึงที่ไม่เคยคิดว่าจะได้ทำเวลาอยู่นอกประเทศคือ เลือกตั้งองค์กรในประเทศนั้น แต่ Netherlands มีองค์กรที่เรียกว่า Water council หรือ สภาจัดการน้ำที่มีอำนาจในการจัดเก็บภาษีน้ำ และจัดการทุกอย่างเกี่ยวกับน้ำในประเทศ ไม่ว่าจะเป็นสร้างเขื่อน กันน้ำท่วมหรือจัดการคุณภาพน้ำให้ดื่มได้</p>\n<p>พรรคการเมืองที่มีให้เลือกก็เป็นพรรคที่มีพรรคการเมืองหลักที่นี่สนับสนุน หรือก็เป็นพรรคการเมืองหลักนี่แหละที่มาลงสมัครด้วย ส่วนตัวยังไม่รู้รายละเอียดการเมืองที่นี่เท่าไหร่ รอบนี้เลยแค่ได้แต่ถามเพื่อน แต่เพื่อนบอกลองตอบคำถามเว็บ <a href=\"https://mijnstem.nl/waterschappen\" target=\"_blank\">https://mijnstem.nl/waterschappen</a> แล้วเลือกตามที่เว็บบอกก็ได้ ลองทำแล้วอ่านว่าพรรคจะทำอะไรบ้างก็ตรงกับที่อยากได้อยู่ วันเลือกตั้งก็เลยกาตามที่เว็บบอกมา</p>\n<p>ก่อนวันเลือกตั้งรัฐบาลที่นี่ก็จะส่งจดหมายเป็นใบที่บอกว่าเรามีสิทธิในการเลือกสภาจัดการน้ำที่นี่นะ วันเลือกตั้งก็เอาบัตรนั้นไปที่หน่วย พร้อมบัตรผู้อยู่อาศัยที่นี่ไปเอาใบลงคะแนน ที่มีรายชื่อผู้สมัครกับรายชื่อพรรคให้เลือกเลย จากนั้นก็ไปที่ตู้ลงคะแนนที่มีดินสอสีแดงให้ระบายชื่อคนที่เราอยากเลือกแค่คนเดียว แล้วก็ไปหย่อนลงคะแนนเป็นอันเสร็จ</p>\n<p>เลือกเสร็จจริงๆ ก็ไม่ได้ตามต่อเท่าไหร่ เพราะเลือกพร้อมกับตัวแทนจังหวัดแล้วพรรคชาวนาที่นี่ได้เสียงเยอะจากที่ไม่เคยได้เลย และตัวแทนจังหวัดสามารถเป็นตัวแทนไปเลือกวุฒิสภาต่อได้ แล้วพรรครัฐบาลที่นี่ปีที่แล้วพึ่งจะพยายามลดกาซไนโตรเจนด้วยการให้ชาวนาลดจำนวนปศุสั้ตว์ลงเป็นล้านตัวจนประท้วงกันทั้งประเทศ ปีนี้พรรครัฐบาลคงทำแบบนั้นไม่ได้แล้ว</p>\n<h2>ปีนึงแล้วยังไงต่อ <a href=\"#%E0%B8%9B%E0%B8%B5%E0%B8%99%E0%B8%B6%E0%B8%87%E0%B9%81%E0%B8%A5%E0%B9%89%E0%B8%A7%E0%B8%A2%E0%B8%B1%E0%B8%87%E0%B9%84%E0%B8%87%E0%B8%95%E0%B9%88%E0%B8%AD\" target=\"_blank\">#</a></h2>\n<p>ส่วนตัวก็ยังชอบ Netherlands อยู่ หลายอย่างรู้สึกมันบ้าดี แต่เวลาเป็นอะไร ป่วย เจ็บตัว คนแปลกหน้าทั้งหลายก็คอยช่วยเหลือ ไม่ต้องห่วงว่าจะอยู่แล้วลำบากเท่าไหร่ ภาษีที่นี่แพงแต่ปลายปีพอได้เงินกลับมาเยอะกว่าที่คิดก็รู้สึกมันไม่ได้เยอะไปกว่าที่เคยต้องเสียไปมาก (แต่ปีนี้เงินเพิ่ม แถมอยู่ครบปีน่าจะต้องเสียเยอะกว่าเดิม)</p>\n<p>ตอนนี้ก็ยังไม่มีแผนอะไรเกินไปกว่าปีหน้า รู้สึกแผนที่ตัวเองมีตอนนี้คือเที่ยว แผนปั่นจักรยานทั้งหลายก็ได้ทำไปเกือบหมดแล้ว ปัญหาส่วนตัวที่คิดว่ามานี่แล้วจะแก้ได้ ก็ยังแก้ไม่ได้และไม่คืบหน้าเท่าไหร่ ก็คงลองอะไรใหม่ไปเรื่อยๆ จนกว่าจะเจออะไรที่ดีกว่านี้หละ</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"9f9ea89613640d290de952a30808d57191d67ca43943dd2252df514f607e8ab2","category":"Category1"}