{"title":"2023","link":"https://www.llun.me/posts/2023-12-31-2023","date":1704041166000,"content":"<p>หลังจากปีที่แล้วย้ายประเทศจากสิงคโปร์ มาอยู่ Netherlands ปีนี้กะว่าจะไม่เปลี่ยนอะไรเยอะแบบนั้นแล้ว และจะเริ่มทำตัวชิว แต่หลายอย่างก็ไม่ชิวอย่างที่คิด กลายเป็นปีที่รู้สึกเหนื่อยกว่าที่คิดโดยเฉพาะเรื่องงาน เป็นปีที่เที่ยวเยอะมากไปมาหลายเมืองแต่รู้สึกจะจังหวะดีเจอช่วงที่ร้อนทุกรอบที่ไปเที่ยว ทั้ง Innsbruck, Paris, Berlin หรือ Slovenia ที่ร้อนกว่าปกติ ตั้งใจว่าจะพักแต่สุดท้ายก็ไม่ได้พักอย่างที่คิด แต่ก็ได้ลองอะไรหลายอย่างที่คิดว่าคงจะทำต่อปีหน้า</p>\n<h2>จักรยาน <a href=\"#%E0%B8%88%E0%B8%B1%E0%B8%81%E0%B8%A3%E0%B8%A2%E0%B8%B2%E0%B8%99\" target=\"_blank\">#</a></h2>\n<p>ปีนี้ปั่นพอๆ กับที่ที่แล้ว ได้ปั่น<a href=\"https://www.strava.com/activities/9374299393\" target=\"_blank\">เส้นที่อยากปั่น</a>และไม่คิดว่าจะเปิด กับปั่นไปทิศตรงข้ามกับปีที่แล้ว ทั้ง Groningen และ Middelburg และได้ลองปั่นเส้นที่อยู่ในป่าช่วงปลายปีที่ไม่คิดว่าจะน่าปั่นกว่าที่คิด (แต่ช่วงหน้าหนาวนี่ปั่นยากหน่อยเพราะฝนตกบ่อย) หน้าร้อนปีหน้าคงไปเก็บเส้นพวกนั้นแทนเส้นปั่นหลัก</p>\n<h2>Activity Pub server <a href=\"#activity-pub-server\" target=\"_blank\">#</a></h2>\n<p>ยังทำอยู่อย่างช้าๆ เพราะปีนี้โดนหลายอย่างดึงความสนใจไปเยอะ ทั้งเรื่องงาน และเที่ยว ตอนแรกคิดว่าจะทำให้ support oauth ปีนี้เพราะจะได้ทำ API ให้ใช้กับ client mastodon ได้แต่ก็ไม่ได้ทำจนถึงปลายปี ไปทำให้ upload assets เข้า Object storage แทนก่อน เพราะ Apple เริ่ม block ไม่ให้ assets โหลดผ่าน CDN ได้แล้ว + feature เล็กๆ น้อยๆ ให้ตัวเองใช้เองสะดวกขึ้น และย้ายจาก NextJS Pages router ไป App Router ด้วย ปีหน้าก็หวังว่าจะมีเวลามาทำมากกว่าเดิมและ support Mastodon client เสียที</p>\n<h2>2024 <a href=\"#2024\" target=\"_blank\">#</a></h2>\n<p>ปีหน้าหวังว่าจะชิวกว่าเดิม หลังๆรู้สึกว่าตัวเองเหนื่อยตลอดเวลา อาจจะเที่ยวน้อยลง แล้วก็หวังว่าจะป่วยน้อยกว่าปีนี้ ส่วนงานก็หวังว่าจะชิวกว่าเดิม แต่ก็ไม่ค่อยสนุกกับทีมที่อยู่เท่าไหร่เทียบกับปีที่แล้ว หวังแค่ว่าปีนี้ทีมจะดีขึ้น และเหนื่อยน้อยลง</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"cf32665d760058c93c0a4b420f30ee51785717d2b75fee8ddc64459b4df31f4f","category":"Category1"}