{"title":"2025, Joining 40 Club","link":"https://www.llun.me/posts/2025-12-16-2025","date":1765911792000,"content":"<p>End of 2025, and as usual, year-end review. However, this year it’s also my end-of-decade review for me.</p>\n<p>2025 is a very tiring year. It’s a lot of changes, both in my work and my personal life, and not really in a great way. It’s a lot of navigating the whole year, full of AI. In my work, most of the colleagues that I worked with have moved out, and people that I used to work with — I think more than half of them — are gone. Although, the team that I joined in the beginning, most of the people are still here.</p>\n<p>It’s not really a reorganization (or maybe it is?), but it’s not really a public one like at the end of last year that my company announced quite publicly. A few new people joined, but the atmosphere is not really the same since the end of last year.</p>\n<p>AI stuff has become more and more integrated into the work. I think this part I kind of enjoyed, at least in the beginning of the year. I feel it’s like a new shiny toy that I hadn’t seen before. It’s a long time that I feel excited like the first iPhone, but after mid-year, it becomes dull and the excitement is gone. I still use it from time to time, especially when writing some bash scripts for small tasks, but big-task-wise, I still prefer to have control over iterating with prompts to all the LLM services.</p>\n<p>Personal-life-wise, this year has a lot of changes! I have a boyfriend, live together for some time now, and we travel quite a lot to Slovenia (his home country). A few dramas along the way, and a few weeks ago, we came for the funeral (and more drama with a car accident recently). It’s a very rough year, and I hope all this rough thing ends in this year.</p>\n<p>Next, I’m going to join the 40 club. In the 30s, I start with some excitement. I got a new job with <a href=\"http://viki.com/\" target=\"_blank\">Rakuten Viki</a>. The company is a similar size to the company I’m working at now (and also a similar feeling in the company, in the Asian way). Then, I joined <a href=\"https://www.referralcandy.com/\" target=\"_blank\">ReferralCandy</a>, which I still think is the best place and company I joined, a lot of things that I learned and fun to build (until I got bored 😬), and ended with Credit Suisse Singapore (which is now gone and becomes UBS?) before coming to the Netherlands. The first year in the Netherlands was fun and exciting; even the winter didn’t hit me much. The last two years, though, it really hit me hard and still feels rough this winter. I’m also more than halfway for PR/citizenship, which might be a time to think and work for it, and I hope in the 40s, it still has some excitement like I was in the 30s.</p>\n<p>And that’s all for this year and this decade, and I’m looking forward to the next year (and next decade).</p>\n","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"d028e4647685584dba3297abf3250a2c3d850d931479852767e54a593293e4e9","category":"Category1"}