{"title":"Freestyle Libre 2","link":"https://www.llun.me/posts/ride/2021-07-24-freestyle-ilbre-2/","date":1627084800000,"content":"\n      \n        <p>ช่วงอาทิตย์ที่ผ่านมาลองเล่น <a href=\"https://www.freestyle.abbott/us-en/products/freestyle-libre-2.html\" target=\"_blank\">Freestyle Libre 2</a> เป็นอุปกรณ์ที่ไว้คอยตรวจน้ำตาลในเลือด เป้าหมายของ sensor จริงๆ ไว้สำหรับให้คนเป็นเบาหวานคอยดูค่าน้ำตาลแบบเกือบ real-time คือเอาอุปกรณ์อ่านค่าแบบ NFC คอยแตะอ่านจากตัว sensor ได้โดย sensor จะคอยวัดน้ำตาลจากของเหลวในผิวหนังไม่ได้วัดจากเลือกตรงๆ ซึ่งค่าน้ำตาลจะขึ้นมาช้ากว่าแบบวัดจากเลือดตรงๆ ประมาณ 5 - 10 นาทีแต่แลกกับไม่ต้องคอยจิ้มนิ้ววัด ข้อมูลที่วัดจะเก็บไว้ใน flash memory ใน sensor ที่เก็บได้ประมาณ 8 ชั่วโมง (ถ้าเกินข้อมูลเก่าสุดจะถูกเขียนทับ)</p>\n<p>ที่สนใจเล่นก็ไม่มีอะไรมากอยากรู้ จริงๆ มีอุปกรณ์วัดร่างกายเกือบครบทุกอย่างแล้วที่ sync เข้ามือถือตั้งแต่เครื่องชั่งน้ำหนัก เครื่องวัดอุณหภูมิ ความดัน หัวใจ เรียกว่าพวก non-invasive นี่ไม่เหลือแล้วที่จะเล่นได้ จนมาเจอ sensor นี้นี่แหละ จริงๆ ก็รู้มาซักพักแล้วว่ามันวัดได้โดยไม่ต้องเจาะนิ้ว (ไม่เล่นซักทีเพราะไม่อยากเจ็บตัว) จนว่างๆ เลยตัดสินใจลองซื้อมาเล่นดู</p>\n<p>ตัว sensor แพงกว่าที่คิด (～ S$91) แถมต้องเปลี่ยนทุก 14 วัน แต่เรื่องนั้นไม่เท่าไหร่ ตอนแรกที่คิดคือมันเป็นแค่แผ่นแปะแขน แต่พอเปิดออกมาดู มันมีเข็ม! แต่อุตส่าห์ซื้อมาแล้ว เปิดกล่องแล้วก็ลองใช้ดูเลยละกัน วิธีแปะแขนดูน่ากลัวเล็กน้อยแต่อุปกณ์ที่มีมาให้ทำให้ดูน่ากลัวน้อยลงแล้วแปะกับแขนง่ายมาก</p>\n<figure>\n  \n  <figcaption>วิธีแปะแขน</figcaption>\n</figure>\n<p>พอแปะเสร็จวันแรกก็วัดมันแทบทุกชั่วโมงสองชั่วโมง แล้วก็พบว่าค่าน้ำตาลตัวเองอยู่ต่ำกว่าปกติตลอด (~3 mmol/L) จนสงสัยว่ามันแม่นป่าว คือกินข้าวทีมันก็ขึ้นไปช่วงสีเขียวแหละ แล้วก็ตกลงมาประมาณ 3 - 4 อย่างรวดเร็ว เป็นมาสองสามวันจนทนสงสัยไม่ไหว วันนี้เลยซื้อแบบเจาะนิ้วมาวัดดูด้วย เอามาวัดคู่ด้วยเลยเพื่อให้แน่ใจ แล้วก็รู้เลยว่ามันวัดพลาด เยอะมาก! วัดวันนี้ตอนกิน coke ไปเล็กน้อย วัดด้วยแบบเจาะเลือดได้ 6.1 mmol/L แต่ Freestyle Libre แบบรอไปแล้ว 5 - 10 นาทีอยู่ที่ ~4.8 mmol/L ห่างกันเยอะมาก เลยลองวัดหลังกินอาหารทันทียิ่งชัดเลย (Freestyle Libre 3.7 ส่วนแบบเจาะเลือดวัดได้ 5.1）ค่านี่ห่างกันประมาณ 1 - 2 mmol/L เพราะงั้นที่วัดได้ ~3 mmol/L ที่ผ่านมาก็ + เพิ่มไปเลยอีก 1 - 2 mmol/L</p>\n<h2>Supersapiens <a href=\"https://www.llun.me/posts/ride/2021-07-24-freestyle-ilbre-2/#supersapiens\">#</a></h2>\n<p>ที่เล่นมาทั้งหมดนี่จริงๆ เพราะสนใจ <a href=\"https://www.supersapiens.com/en-EN/\" target=\"_blank\">sensor</a> อยู่คือวัดแบบ real time แล้วบอกได้เลยว่า น้ำตาลในเลือดมีอยู่เท่าไหร่แล้วส่งไปที่ head unit ให้เห็น ตัว sensor นี่เหมือน Freestyle Libre 2 นี่แหละแต่มี bluetooth （หรือ Ant+?) ด้วย ที่สนใจเพราะเวลาปั่นจักรยานไกลๆ สิ่งที่เป็นปัญหามากคืออาหารที่ต้องคอยกินตลอด ถ้าไม่กินให้พอ หรือไม่ยอมหยุดก็จะ <a href=\"https://www.ride25.com/cycling-blog/bonking-birds-bees/\" target=\"_blank\">bonk</a> ได้ แล้ว sensor แบบนี้ก็มาตอบโจทย์ตรงนี้นี่แหละ ที่ไว้ดูว่าต้องหยุดเมื่อไหร่บ้างหรือจะออกแรงปั่นเร็วเต็มที่ได้นานแค่ไหน</p>\n<p>แต่จากประสบการณ์ที่เล่น Freestyle Libre 2 มารู้สึกค่ามันไม่แม่นเท่าไหร่เดี๋ยวคงลองเล่นกับ sensor ใหม่อีกรอบ (เพราะรอบนี้เหมือนแปะไว้ผิดตำแหน่ง) แล้วจะลองวัดเทียบค่าอีกที ถ้าค่ามันแม่นเทียบกับแบบเจาะเลือดใน sensor ชุดต่อไป คงได้ลอง Supersapians กับตอนปั่นจักรยาน！</p>\n\n        <p>\n          <a href=\"mailto:comment@llun.me?subject=Common on post https://www.llun.me/posts/ride/2021-07-24-freestyle-ilbre-2/\">Send a comment</a>\n        </p>\n      \n    ","author":"Maythee Anegboonlap","siteTitle":"@llun story","siteHash":"e492a4c5a091b6624e5872d8d003bc73eb1166cc8f88db58c44e1f8dfb9c7252","entryHash":"e91ad754bcf8440ac6ba486cb4cbfb528320ef7ec7bd59da868d0ffd739fd3a6","category":"Me"}